lms/stress-test/artillery.yml
config:
  target: "{{ $processEnvironment.TARGET || 'http://10.0.0.5:4000' }}"
  phases:
    # Giai đoạn 1: Lưu lượng nền (2 phút)
    - duration: 120
      arrivalRate: 2
      name: "Baseline - Browse traffic"

    # Giai đoạn 2: Burst traffic (30 giây)
    - duration: 10
      arrivalRate: 2
      rampTo: 50
      name: "Ramp up"
    - duration: 30
      arrivalRate: 50
      name: "Burst - 500 registrations"

    # Giai đoạn 3: Hồi phục (2 phút)
    - duration: 30
      arrivalRate: 50
      rampTo: 2
      name: "Ramp down"
    - duration: 120
      arrivalRate: 2
      name: "Recovery - Check results"

  defaults:
    headers:
      Content-Type: "application/json"

  variables:
    # Random student ID (1-500)
    studentNum:
      - 1
      - 50
      - 100
      - 150
      - 200
      - 250
      - 300
      - 350
      - 400
      - 450
      - 500

  processor: "./functions.js"

scenarios:
  # 30% traffic: Login + Browse
  - name: "Browse courses"
    weight: 30
    flow:
      - function: "generateStudent"
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ username }}"
            password: "password123"
          capture:
            - json: "$.token"
              as: "token"
      - think: 2
      - get:
          url: "/api/courses"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 3
      - get:
          url: "/api/courses"
          headers:
            Authorization: "Bearer {{ token }}"

  # 60% traffic: Login + Register (stress point)
  - name: "Register for course"
    weight: 60
    flow:
      - function: "generateStudent"
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ username }}"
            password: "password123"
          capture:
            - json: "$.token"
              as: "token"
      - think: 1
      - get:
          url: "/api/courses"
          headers:
            Authorization: "Bearer {{ token }}"
      - function: "pickRandomCourse"
      - post:
          url: "/api/register"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            course_id: "{{ courseId }}"
      - think: 2
      - get:
          url: "/api/register/my"
          headers:
            Authorization: "Bearer {{ token }}"

  # 10% traffic: Login + Register + Cancel
  - name: "Register and cancel"
    weight: 10
    flow:
      - function: "generateStudent"
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ username }}"
            password: "password123"
          capture:
            - json: "$.token"
              as: "token"
      - function: "pickRandomCourse"
      - post:
          url: "/api/register"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            course_id: "{{ courseId }}"
          capture:
            - json: "$.registration_id"
              as: "regId"
      - think: 3
      - delete:
          url: "/api/register/{{ regId }}"
          headers:
            Authorization: "Bearer {{ token }}"